* Weather Queries

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "San Francisco") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5391959",
:       "name": "San Francisco"
:     }
:   }
: }

#+begin_src restclient
  GET	
#+end_src

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Seattle") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5809844",
:       "name": "Seattle"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Portland") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5746545",
:       "name": "Portland"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Los Angeles") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5368361",
:       "name": "Los Angeles"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "San Diego") {
      country
      id
      name
    }
  }
#+end_src

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Chicago") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "4887398",
:       "name": "Chicago"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "New Orleans") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "4335045",
:       "name": "New Orleans"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "New York") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5128581",
:       "name": "New York"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Boston") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "4930956",
:       "name": "Boston"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Honolulu") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "US",
:       "id": "5856195",
:       "name": "Honolulu"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Phuket") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "TH",
:       "id": "1151253",
:       "name": "Phuket"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Sydney") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "AU",
:       "id": "2147714",
:       "name": "Sydney"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "London") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "GB",
:       "id": "2643743",
:       "name": "London"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Tokyo") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "JP",
:       "id": "1850144",
:       "name": "Tokyo"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Saigon") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "VN",
:       "id": "1580578",
:       "name": "Ho Chi Minh City"
:     }
:   }
: }

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    getCityByName(name: "Lisbon") {
      country
      id
      name
    }
  }
#+end_src

#+RESULTS:
: {
:   "data": {
:     "getCityByName": {
:       "country": "PT",
:       "id": "2267057",
:       "name": "Lisbon"
:     }
:   }
: }

* NomadPages Queries

#+begin_src graphql :url http://localhost:8081/v1/graphql
  query MyQuery {
    city {
      id
      weather {
        name
      }
    }
  }
#+end_src

#+RESULTS:
#+begin_example
{
  "data": {
    "city": [
      {
        "id": "1b16c7e8-0a64-46a7-a945-844c04df68da",
        "weather": [
          {
            "name": "San Francisco"
          }
        ]
      },
      {
        "id": "b1542c96-46bf-4b5c-a47b-d78babb81eb8",
        "weather": [
          {
            "name": "Seattle"
          }
        ]
      },
      {
        "id": "75fe47ec-164e-42b0-9266-19c744c61409",
        "weather": [
          {
            "name": "Portland"
          }
        ]
      },
      {
        "id": "642e1dfb-d414-45a7-b78c-f420571d08f0",
        "weather": [
          {
            "name": "Los Angeles"
          }
        ]
      },
      {
        "id": "b1a0ba20-e483-4ec5-a728-3cd5ca3dc9a4",
        "weather": [
          {
            "name": "Chicago"
          }
        ]
      },
      {
        "id": "bd738df3-60b8-44db-aee2-238ba12e6658",
        "weather": [
          {
            "name": "New Orleans"
          }
        ]
      },
      {
        "id": "72dfc1cd-fab8-4376-84ba-c3ee0fe96275",
        "weather": [
          {
            "name": "New York"
          }
        ]
      },
      {
        "id": "ba67d3e6-7089-47b7-a4f5-ea6c1207c952",
        "weather": [
          {
            "name": "Boston"
          }
        ]
      },
      {
        "id": "3769699a-001e-4943-9ff3-4ac72ec8bbf2",
        "weather": [
          {
            "name": "Honolulu"
          }
        ]
      },
      {
        "id": "33497b06-f50d-447d-a773-6389a6b2d4cd",
        "weather": [
          {
            "name": "Phuket"
          }
        ]
      },
      {
        "id": "f92d7b62-6b77-4b64-ac0c-d76b01d19f44",
        "weather": [
          {
            "name": "Sydney"
          }
        ]
      },
      {
        "id": "7a76ff83-8473-49e5-aa16-e2ea6a63d310",
        "weather": [
          {
            "name": "London"
          }
        ]
      },
      {
        "id": "ef058257-9d04-4d93-b97b-8761649a36b3",
        "weather": [
          {
            "name": "Tokyo"
          }
        ]
      },
      {
        "id": "72ad6499-38c6-44e8-a8c8-af63ea72c2e4",
        "weather": [
          {
            "name": "Ho Chi Minh City"
          }
        ]
      },
      {
        "id": "fe13905f-6337-4069-b92e-79d9acd27c5b",
        "weather": [
          {
            "name": "Lisbon"
          }
        ]
      }
    ]
  }
}
#+end_example

